toddfries/OpenBSD-sys-patches/arch/sparc64/stand/installboot/installboot.8
<<<<<<< HEAD
.\"	$OpenBSD: installboot.8,v 1.6 2004/12/06 20:19:38 deraadt Exp $
=======
.\"	$OpenBSD: installboot.8,v 1.10 2010/04/06 06:33:50 jmc Exp $
>>>>>>> origin/master
.\"	$NetBSD: installboot.8,v 1.1 1995/09/30 21:32:14 pk Exp $
.\"
.\" Copyright (c) 1995 Paul Kranenburg
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Paul Kranenburg.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
<<<<<<< HEAD
.Dd September 6, 2001
=======
.Dd $Mdocdate: April 6 2010 $
>>>>>>> origin/master
.Dt INSTALLBOOT 8 sparc64
.Os
.Sh NAME
.Nm installboot
.Nd install a bootstrap on an FFS filesystem partition
.Sh SYNOPSIS
.Nm installboot
.Op Fl nv
.Ar bootblk
.Ar device
.Sh DESCRIPTION
.Nm installboot
prepares an FFS filesystem partition for boot-strapping from the PROM.
The sparc bootblocks are split into two parts: a small first-stage program that
is written into the superblock area in a partition
.Po
and hence is limited in size to SBSIZE - DEV_BSIZE bytes
.Pc ,
and a second-stage program that resides in the filesystem proper.
The first-stage program is loaded into memory by the PROM.
After it receives control, it loads the second stage program
.Ar ofwboot
from the filesystem.
The second-stage boot program uses the device driver interface to
the PROM and the stand-alone filesystem code in
.Dq libsa.a
to locate and load the kernel.
The second-stage boot program and the prototype code for the
first-stage bootprogram can be found in
.Pa /usr/mdec/ofwboot
and
.Pa /usr/mdec/bootblk
respectively.
The second-stage program commonly resides in the root directory as
.Pa /ofwboot .
.Pp
The options are as follows:
.Bl -tag -width flag
.It Fl n
Do not actually write anything on the disk.
.It Fl v
Verbose mode.
.El
.Pp
The arguments are:
.Bl -tag -width ofwboot
.It Ar bootblk
the name of the prototype file for the first stage boot program.
.It Ar device
the name of the raw device in which the first-stage boot program
is to be installed.
This should correspond to the block device on which the file system containing
.Ar ofwboot
is mounted.
.El
.Sh EXAMPLES
The following commands will install the first-stage bootblocks in the
root filesystem
.Pq assumed to be mounted on Dq sd0a
using the file
.Pa /ofwboot
as the second-level boot program:
.Bd -literal -offset indent
# cp /usr/mdec/ofwboot /ofwboot
# /usr/mdec/installboot /usr/mdec/bootblk /dev/rsd0c
.Ed
.Sh SEE ALSO
.Xr disklabel 8 ,
.Xr init 8
.Sh HISTORY
The
.Nm installboot
first appeared in
.Nx 1.1 .
